Repository: Robert01101101/Portfolio-RMichels
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de_de

source: The share UI has gone through multiple iterations. Initially developed for
de_de: Die Benutzeroberfläche für die Freigabe hat mehrere Iterationen durchlaufen. Ursprünglich entwickelt mit

source: with few options, the feature was later expanded to include expiry, password protection, and embed functionalities. Finally, in 2023, the UI was refreshed in collaboration with
de_de: mit wenigen Optionen, wurde die Funktion später um Funktionen wie Ablaufdatum, Passwortschutz und Einbettung erweitert. Im Jahr 2023 wurde die Benutzeroberfläche neu designed in Zusammenarbeit mit

source: , who designed mockups in Figma, as the Clirio View app was migrated to
de_de: , der Mockups in Figma entwarf, als die Clirio View App mirgriert wurde zu

source: When a user opens the share panel for a scan, the client checks whether there are existing links. If there are, the existing links are provided for the user to share. For any new configuration of a share that hasn't been created yet, the user can press generate, and a request will be sent to a backend API implemented by
de_de: Wenn ein Benutzer das Freigabe-Panel für einen Scan öffnet, prüft der Client, ob es bereits Links gibt. Wenn dies der Fall ist, werden die vorhandenen Links für den Benutzer zur Freigabe bereitgestellt. Für jede neue Konfiguration einer Freigabe, die noch nicht erstellt wurde, kann der Benutzer auf Generieren drücken, woraufhin eine Anfrage an eine Backend-API gesendet wird, die entwickelt wurde von

source: The returned result includes a URL for the client to display to the user, and to include in native share options for each platform.
de_de: Das zurückgegebene Ergebnis enthält eine URL, die der Client dem Benutzer anzeigen und in die nativen Freigabeoptionen für jede Plattform aufnehmen kann.

source: The biggest challenge for me was designing the UX, as there were a lot of options for the user. This included the option to make shares private so that users could restrict sharing internally to teams in workspaces, which required an additional authentication flow in the webviewer as well. The range of options also made it more difficult to design a compact UI. I utilized dynamic design and layouts so that hidden options such as expiry renewal or password change could be elegantly hidden or shown. Developing the logic was a fairly easy process, thinking about how the feature should work in the first place was the bigger challenge. After every user interaction, the UI refreshes to match the share configuration and all other states. If there is a share matching the configuration, that existing link is shown, otherwise the generate share button is shown.
de_de: Die größte Herausforderung für mich war die Gestaltung der Benutzeroberfläche, da es eine Vielzahl von Optionen für den Benutzer gab. Dazu gehörte auch die Option, Freigaben privat zu machen, so dass Benutzer die Freigabe intern auf Teams in Arbeitsbereichen beschränken konnten, was ebenfalls einen zusätzlichen Authentifizierungsfluss im Webviewer erforderte. Die Vielzahl der Optionen erschwerte auch die Gestaltung einer kompakten Benutzeroberfläche. Ich nutzte dynamisches Design und Layouts, damit versteckte Optionen wie die Verlängerung des Gültigkeitszeitraums oder die Änderung des Passworts elegant ein- oder ausgeblendet werden konnten. Die Entwicklung der Logik war ein relativ einfacher Prozess, die größere Herausforderung war die Überlegung, wie die Funktion überhaupt funktionieren sollte. Nach jeder Benutzerinteraktion wird die Benutzeroberfläche aktualisiert, um der Freigabekonfiguration und allen anderen Zuständen zu entsprechen. Wenn es eine Freigabe gibt, die mit der Konfiguration übereinstimmt, wird dieser vorhandene Link angezeigt, andernfalls wird die Schaltfläche zum Erzeugen einer Freigabe angezeigt.

source: An interesting change to my approach to writing controllers was first tested in this feature, after a discussion I had with my teammate
de_de: Eine interessante Änderung meiner Herangehensweise an das Schreiben von Controllern wurde zum ersten Mal in diesem Feature getestet, nach einer Diskussion mit meinem Teamkollegen

source: In the past, I would write public functions for button clicks, and hook them up in the inspector via the button's
de_de: In der Vergangenheit habe ich öffentliche Funktionen für Buttonklicks geschrieben und sie im Unity Inspektor verknüpft über das

source: event. Here, I instead set all the event listeners in the controller itself, kept all the corresponding listener functions private, and simplified the inspector setup so that each button only gets assigned once to the controller, and no other reference is needed. This makes setup in the editor less error-prone and maintainable, as it requires less understanding of the code.
de_de: Event. Hier habe ich stattdessen alle Ereignis-Listener im Controller selbst gesetzt, alle entsprechenden Listener-Funktionen privat gehalten und die Einrichtung des Inspektors vereinfacht, so dass jede Schaltfläche nur einmal dem Controller zugewiesen wird und keine weitere Referenz benötigt wird. Dies macht die Einrichtung im Editor weniger fehleranfällig und wartbar, da es weniger Verständnis für den Code erfordert.

source: Implementing the webviewer was the more complex story, as it was standalone and most functionality needed to be created from scratch. The viewer was written in C# with Blazor, JavaScript with Three.js, and uses Tailwind CSS for styling. I had worked with Three.js in the past and enjoyed using it again, and a lot of my work revolved around setting up the viewer correctly.
de_de: Die Implementierung des Webviewers war die komplexere Geschichte, da es sich um eine eigenständige Anwendung handelt und die meisten Funktionen von Grund auf neu erstellt werden mussten. Der Viewer wurde in C# mit Blazor und JavaScript mit Three.js geschrieben und verwendet Tailwind CSS für das Styling. Ich hatte bereits in der Vergangenheit mit Three.js gearbeitet und genoss es, es wieder zu verwenden, und ein Großteil meiner Arbeit drehte sich darum, den Viewer korrekt einzurichten.

source: When the user opens a share link, the page sends a request to our backend API to gather information about the share, including whether it's public, and a list of SAS tokens for all the files required to render the scan. If the scan is private, the user is routed to a login page, otherwise, the scan begins to load its resources right away. The viewer is lightweight, and only provides some metadata, and options to reset the view and show/hide the grid and dimensions legend.
de_de: Wenn der Benutzer einen Freigabelink öffnet, sendet die Seite eine Anfrage an unsere Backend-API, um Informationen über die Freigabe zu sammeln, einschließlich der Angabe, ob sie öffentlich ist, und eine Liste von SAS-Tokens für alle Dateien, die zum Rendern des Scans erforderlich sind. Wenn der Scan privat ist, wird der Benutzer zu einer Anmeldeseite weitergeleitet, andernfalls beginnt der Scan sofort mit dem Laden seiner Ressourcen. Der Viewer ist leichtgewichtig und bietet nur einige Metadaten sowie Optionen zum Zurücksetzen der Ansicht und zum Ein- und Ausblenden des Rasters und der Dimensionslegende.

source: Challenges with the setup of Three.js included adding support for loading the texture files defined in the MTL file with the correct SAS tokens, ensuring different MTL file formats and material properties are supported and displayed as desired, and making the viewer dynamic so it supports a wide range of model sizes and shapes, on a wide range of devices.
de_de: Zu den Herausforderungen bei der Einrichtung von Three.js gehörten das Hinzufügen von Unterstützung für das Laden der in der MTL-Datei definierten Texturdateien mit den korrekten SAS-Tokens, die Sicherstellung, dass verschiedene MTL-Dateiformate und Materialeigenschaften unterstützt und wie gewünscht angezeigt werden, und die Gestaltung eines dynamischen Viewers, der eine breite Palette von Modellgrößen und -formen auf einer Vielzahl von Geräten unterstützt.

source: The code snippet below contains the code related to loading the 3D Model inside the webviewer, using Three.js. It's a small section of the actual file, but it shows some of the solutions to challenges encountered, such as the modified process for loading the textures defined in the MTL file using SAS tokens, and functions to help configure the viewer based on the model dimensions.
de_de: Der unten stehende Codeschnipsel enthält den Code zum Laden des 3D-Modells im Webviewer mit Three.js. Es handelt sich um einen kleinen Ausschnitt aus der eigentlichen Datei, aber er zeigt einige der Lösungen für aufgetretene Herausforderungen, wie z. B. den geänderten Prozess zum Laden der in der MTL-Datei definierten Texturen mithilfe von SAS-Tokens und Funktionen zur Konfiguration des Viewers auf der Grundlage der Modellabmessungen.

source: Amae is a utility app for busy parents. Amae helps parents to manage their time, learn about parenting and get help easily and quickly.
de_de: Amae ist eine nützliche App für viel beschäftigte Eltern. Amae hilft Eltern, ihre Zeit zu managen, etwas über Erziehung zu lernen und einfach und schnell Hilfe zu bekommen.

source: The Task
de_de: Die Aufgabe

source: This project was a design exercise to create a user interface mockup. It was created for an interface design course that focused on goal-oriented design. Consequently, a big part of the project was identifying user needs within a particular domain, and designing a product that helps the users achieve their goals.
de_de: Bei diesem Projekt handelte es sich um eine Designübung zur Erstellung eines Benutzeroberflächen-Mockups. Es wurde für einen Schnittstellendesign-Kurs erstellt, der sich auf zielorientiertes Design konzentrierte. Daher bestand ein großer Teil des Projekts darin, die Bedürfnisse der Nutzer in einem bestimmten Bereich zu ermitteln und ein Produkt zu entwerfen, das den Nutzern hilft, ihre Ziele zu erreichen.

source: Our domain was that of young parents. With our design, we tried to create an app that helps parents coordinate their parenting tasks, as well as get help easily and quickly when in need.
de_de: Unsere Domäne war die der jungen Eltern. Mit unserem Design haben wir versucht, eine App zu entwickeln, die Eltern dabei hilft, ihre Erziehungsaufgaben zu koordinieren und bei Bedarf einfach und schnell Hilfe zu bekommen.

source: The Result
de_de: Das Ergebnis

source: The dashboard helps parents with their most frequent tasks. Parents can coordinate recurring tasks, such as diaper changes, as well as scheduled events, such as doctor appointments.
de_de: Das Dashboard hilft Eltern bei ihren häufigsten Aufgaben. Eltern können wiederkehrende Aufgaben, wie Windelwechsel, sowie geplante Ereignisse, wie Arzttermine, koordinieren.

source: With the nanny feature, users can browse for and book nearby nannies. Their profiles show ratings and reviews, their skills, and more information. Users can also easily rebook previously booked nannies.
de_de: Mit der Nannies-Funktion können die Nutzer nach Nannies in der Nähe suchen und diese buchen. Ihre Profile zeigen Bewertungen und Rezensionen, ihre Fähigkeiten und weitere Informationen. Außerdem können die Nutzer bereits gebuchte Nannies einfach umbuchen.

source: Learn features curated articles, relevant news as well as community discussions. This helps parents as well as nannies learn more about child-rearing and provides a parenting community to engage with.
de_de: Learn bietet kuratierte Artikel, relevante Nachrichten und Diskussionen in der Gemeinschaft. Dies hilft Eltern und Nannies, mehr über Kindererziehung zu lernen und bietet eine Eltern-Community, in der sie sich engagieren können.

source: The chat feature doubles as an easy way to stay in touch with other caretakers, as well as a way to organize. Through chat, parents can assign tasks to each other, as well as book and manage an appointment with a nanny.
de_de: Die Chat-Funktion ist eine einfache Möglichkeit, mit anderen Betreuern in Kontakt zu bleiben und sich zu organisieren. Über den Chat können sich die Eltern gegenseitig Aufgaben zuweisen und einen Termin mit einem Nannies buchen und verwalten.

source: Design artifacts that detail components of our design & define a clear styleguide to achieve consistency.
de_de: Design-Artefakte, die die Komponenten unseres Designs detailliert beschreiben und einen klaren Styleguide definieren, um Konsistenz zu erreichen.

source: Process
de_de: Prozess

source: The project was developed in 4 months by a team of 5. I was the project manager, as well as one of the UX and UI designers. Our process began with brief domain brainstorming, followed by an ethnography study to better understand our users. After coming up with personas and multiple concept ideas, we focused on Amae. We then designed our product. For this, we designed many artifacts, such as flowcharts, wireframes, user journey maps, interaction patterns, and a style guide. In the last stages, we performed user testing and refinement. An outcome of this was that we dropped a health feature we had previously planned to include. Finally, we created a product website to present our final design.
de_de: Das Projekt wurde in 4 Monaten von einem 5-köpfigen Team entwickelt. Ich war der Projektleiter sowie einer der UX- und UI-Designer. Unser Prozess begann mit einem kurzen Domain-Brainstorming, gefolgt von einer ethnografischen Studie, um unsere Nutzer besser zu verstehen. Nachdem wir Personas und mehrere Konzeptideen entwickelt hatten, konzentrierten wir uns auf Amae. Dann haben wir unser Produkt entworfen. Dazu entwarfen wir zahlreiche Artefakte wie Flussdiagramme, Wireframes, User Journey Maps, Interaktionsmuster und einen Style Guide. In den letzten Phasen führten wir Benutzertests und Verfeinerungen durch. Ein Ergebnis davon war, dass wir eine Gesundheitsfunktion, die wir ursprünglich geplant hatten, weggelassen haben. Schließlich erstellten wir eine Produktwebsite, um unser endgültiges Design zu präsentieren.

source: One of our core challenges throughout the design process was making the app safe. One of our solutions was the design of the nanny experience. Nannies can learn and get certified through the Learn feature. Their thorough profiles feature ratings, reviews, and skills, to allow parents to find the best nanny for their needs. Parents can see what tasks a nanny has completed, call them at any time, and report a nanny. These features aim to maximize transparency to create a safe experience.
de_de: Eine unserer größten Herausforderungen während des Designprozesses war es, die App sicher zu machen. Eine unserer Lösungen war die Gestaltung der Nanny-Erfahrung. Nannies können über die Funktion Lernen lernen und sich zertifizieren lassen. Ihre ausführlichen Profile enthalten Bewertungen, Rezensionen und Fähigkeiten, damit Eltern das beste Nannies für ihre Bedürfnisse finden können. Eltern können sehen, welche Aufgaben ein Nannies erledigt hat, sie jederzeit anrufen und ein Nannies melden. Diese Funktionen zielen darauf ab, die Transparenz zu maximieren und eine sichere Erfahrung zu schaffen.

source: Result & Design Artifacts
de_de: Ergebnis & Design-Artefakte

source: You can try the interactive mockup below, and take a look at the file itself. We got very positive feedback and were satisfied with our final result, the journey we took to get there, and the things we learned along the way.
de_de: Sie können das interaktive Mockup unten ausprobieren und einen Blick auf die Datei selbst werfen. Wir haben sehr positives Feedback erhalten und waren mit unserem Endergebnis, dem Weg dorthin und den Dingen, die wir auf dem Weg gelernt haben, zufrieden.

source: Design Artifacts
de_de: Design-Artefakte

source: Below are a selection of various design artifacts from this project. These represent many stages of our process, from researching our audience and their needs, to planning out UX flows and wireframes, to our final presentation of the mockup via a fictional product website, which was created in a 2 day sprint.
de_de: Im Folgenden finden Sie eine Auswahl verschiedener Design-Artefakte aus diesem Projekt. Diese repräsentieren viele Phasen unseres Prozesses, von der Erforschung unserer Zielgruppe und ihrer Bedürfnisse über die Planung von UX-Flows und Wireframes bis hin zu unserer abschließenden Präsentation des Mockups über eine fiktive Produktwebsite, die in einem zweitägigen Sprint erstellt wurde.

source: Future Earth is a VR adventure game set in a dystopian future, where the player has to grow trees, fight droids and collect parts. Achieved over 3,000 downloads and 4 stars on SideQuest.
de_de: Future Earth ist ein VR-Abenteuerspiel, das in einer dystopischen Zukunft spielt, in der der Spieler Bäume pflanzen, Droiden bekämpfen und Teile sammeln muss. Auf SideQuest hat das Spiel über 3.000 Downloads und 4 Sterne erhalten.

source: Future Earth was created as an exercise in designing and developing immersive environments.
de_de: Future Earth wurde als Übung für die Gestaltung und Entwicklung immersiver Umgebungen entwickelt.

source: With the concept design, we aimed to create a VR adventure game that encourages sustainable behaviors in players. This is achieved by placing the player in a dystopian futuristic environment and giving them the power to radically transform it for the better through gameplay.
de_de: Mit dem Konzeptentwurf wollten wir ein VR-Abenteuerspiel schaffen, das die Spieler zu nachhaltigen Verhaltensweisen anregt. Dies wird erreicht, indem wir den Spieler in eine dystopische, futuristische Umgebung versetzen und ihm die Macht geben, diese durch das Spiel radikal zum Besseren zu verändern.

source: Story
de_de: Geschichte

source: Set in a dystopian future, you are the first human to walk planet earth in a long time.
de_de: In einer dystopischen Zukunft bist du der erste Mensch, der seit langer Zeit die Erde bewandert.

source: Your mission objective is to plant and sustain 100 trees. Whether or not humanity will attempt to return to earth hinges upon your success.
de_de: Ihr Missionsziel ist es, 100 Bäume zu pflanzen und zu erhalten. Von Ihrem Erfolg hängt es ab, ob die Menschheit versuchen wird, zur Erde zurückzukehren oder nicht.

source: But that isn't an easy feat. Climate change and unsustainable human habits have created a toxic wasteland. And to make things worse, robots left behind to clean up, have fried in the sun and turned dangerous over time. Fight these bots, collect technical components, build sustainable technology and become the one to save the world!
de_de: Doch das ist kein leichtes Unterfangen. Der Klimawandel und unhaltbare menschliche Gewohnheiten haben ein giftiges Ödland geschaffen. Und zu allem Übel sind die Roboter, die zum Aufräumen zurückgelassen wurden, in der Sonne gebraten und mit der Zeit gefährlich geworden. Bekämpfe diese Bots, sammle technische Komponenten, baue nachhaltige Technologie und werde derjenige, der die Welt rettet!

source: Success
de_de: Erfolg

source: Our project won best overall project, best interaction design, project for impact, and best VR/AR in our class.
de_de: Unser Projekt gewann den Preis für das beste Gesamtprojekt, das beste Interaktionsdesign, das beste Projekt für die Wirkung und das beste VR/AR-Projekt in unserer Klasse.

source: We're proud to have achieved over 3,000 downloads and a 4 star rating with our release to SideQuest.
de_de: Wir sind stolz darauf, auf dem SideQuest VR Store über 3.000 Downloads und eine 4 Sterne Bewertung erreicht zu haben.

source: The project was developed in 4 months by a team of 4. I was the project manager, as well as one of the VR / game designers & developers.
de_de: Das Projekt wurde in 4 Monaten von einem 4-köpfigen Team entwickelt. Ich war der Projektleiter sowie einer der VR-/Spieldesigner und -entwickler.

source: After deciding to create a project for impact with the theme of sustainability, we started to create a game. Our goal was to create a VR game that appeals to players without particular interest in sustainability, to reach a broader audience.
de_de: Nachdem wir beschlossen hatten, ein Impact-Projekt zum Thema Nachhaltigkeit zu entwickeln, begannen wir mit der Erstellung eines Spiels. Unser Ziel war es, ein VR-Spiel zu entwickeln, das auch Spieler ohne Interesse an Nachhaltigkeit anspricht, um ein breiteres Publikum zu erreichen.

source: As the PM, I split the concept design into a list of core and bonus features. The core design featured a small game, where players fight rogue robots, collect their parts, and build water filtering technology that helps trees to grow. This core prototype was implemented within the first three months.
de_de: Als PM teilte ich das Konzeptdesign in eine Liste von Kern- und Bonusfunktionen auf. Der Kernentwurf beinhaltete ein kleines Spiel, in dem die Spieler gegen bösartige Roboter kämpfen, deren Teile sammeln und eine Wasserfiltertechnologie bauen, die Bäumen beim Wachsen hilft. Dieser Kernprototyp wurde innerhalb der ersten drei Monate umgesetzt.

source: After a round of usertesting, we proceed to implement updated features in response to our testing results. These included measures to better communicate the narrative, such as a major update to the level design and the implementation of an aesthetic change as the player plants more trees. We also had time to implement some of our bonus features, which were mostly aesthetic improvements such as the addition of VFX, better models, and multiple collectible parts.
de_de: Nach einer Runde von Benutzertests haben wir als Reaktion auf die Testergebnisse aktualisierte Funktionen implementiert. Dazu gehörten Maßnahmen zur besseren Vermittlung der Geschichte, wie z. B. eine umfassende Aktualisierung des Leveldesigns und die Implementierung einer ästhetischen Veränderung, wenn der Spieler mehr Bäume pflanzt. Wir hatten auch Zeit, einige unserer Bonus-Features zu implementieren, bei denen es sich hauptsächlich um ästhetische Verbesserungen handelte, wie z. B. das Hinzufügen von VFX, bessere Modelle und mehrere sammelbare Teile.

source: The Code
de_de: Der Code

source: My programming efforts for this project focussed on the more unusual features of our game, such as spare part collection, item building, UI interactions, story sequencing and more. Another interesting feature I implemented was the trees, which required animations for growth and monitoring of their health based on the available water supply. In order to achieve fine control over the growth behavior, I used a Coroutine, which is also used to control dying trees. Instead of using an Unity animation I implemented smooth growth by affecting scale and rotation with the help of
de_de: Meine Programmierarbeit für dieses Projekt konzentrierte sich auf die ungewöhnlicheren Funktionen unseres Spiels, wie z. B. das Sammeln von Ersatzteilen, das Bauen von Gegenständen, die Interaktion mit der Benutzeroberfläche, die Abfolge der Geschichte und mehr. Eine weitere interessante Funktion, die ich implementiert habe, waren die Bäume, die Animationen für das Wachstum und die Überwachung ihres Gesundheitszustands auf der Grundlage der verfügbaren Wasservorräte benötigten. Um eine feine Kontrolle über das Wachstumsverhalten zu erreichen, habe ich eine Coroutine verwendet, die auch zur Kontrolle sterbender Bäume eingesetzt wird. Anstatt eine Unity-Animation zu verwenden, implementierte ich ein sanftes Wachstum, indem ich Skalierung und Rotation definierte mit Hilfe von

source: and
de_de: und
