Repository: Robert01101101/Portfolio-RMichels
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de_de

source: for smoothing. A challenge that came up was a bug where birds would land at the position of the tree's origin. The fix was simple: disabling their perch-targets until the trees had finished growing, and only then enabling them, so that their target positions were correctly located at the fully grown branches.
de_de: für die Glättung. Eine Herausforderung war ein Fehler, bei dem die Vögel an der Position des Baumursprungs landeten. Die Lösung war einfach: Die Sitzstangen-Ziele wurden deaktiviert, bis die Bäume fertig gewachsen waren, und erst dann aktiviert, so dass sich die Zielpositionen korrekt an den ausgewachsenen Ästen befanden.

source: One of the interesting changes that resulted from our user tests was the more drastic environment change coupled to player progress. The environment changes as the player plants more trees. In order to achieve the desired emotional effect with the player, we incorporated many variable layers: the skybox, fog, dust particles, water, lighting and post processing. All of these aspects of the environment are interpolated between a start and an end state, by the method
de_de: Eine der interessanten Änderungen, die sich aus unseren Benutzertests ergaben, war die drastischere Veränderung der Umgebung in Abhängigkeit vom Fortschritt des Spielers. Die Umgebung verändert sich, wenn der Spieler mehr Bäume pflanzt. Um die gewünschte emotionale Wirkung beim Spieler zu erzielen, haben wir viele variable Ebenen eingebaut: die Skybox, Nebel, Staubpartikel, Wasser, Beleuchtung und Nachbearbeitung. All diese Aspekte der Umgebung werden zwischen einem Start- und einem Endzustand interpoliert, und zwar mit der Methode

source: which I implemented in
de_de: die ich implementierte in

source: For instance, the fog has definitions of its color, start distance and end distance for both the beginning and the end.
de_de: Zum Beispiel hat der Nebel Definitionen für seine Farbe, die Startdistanz und die Enddistanz sowohl für den Anfang als auch für das Ende des Nebels.

source: Filter Projects
de_de: Projekte Filtern

source: While on vacation in Rome, I became frustrated with the lack of options available for free detailed tours of the city. There are websites with suggested daily schedules, Google Maps supports adding a small number of places into a route, but I couldn't find a cohesive platform combining navigation and information on the places I visit into a tour I can simply follow. Like any programmer would, I thought to myself, 'I can create an app for this!'
de_de: Während meines Urlaubs in Rom war ich frustriert über den Mangel an kostenlosen, detaillierten Stadtführungen. Es gibt Websites mit vorgeschlagenen Tagesplänen, Google Maps unterstützt das Hinzufügen einer kleinen Anzahl von Orten zu einer Route, aber ich konnte keine zusammenhängende Plattform finden, die Navigation und Informationen über die Orte, die ich besuche, zu einer Tour kombiniert, der ich einfach folgen kann. Wie jeder Programmierer dachte ich mir: 'Dafür kann ich eine App entwickeln!'

source: I had my eye on the Flutter framework, and this seemed like the perfect opportunity to learn the Dart language and how to build a crossplatform app with Flutter.
de_de: Mein Auge war auf das Flutter-Framework gerichtet, und dies schien mir die perfekte Gelegenheit zu sein, die Sprache Dart zu lernen und zu erfahren, wie man mit Flutter eine plattformübergreifende Anwendung erstellt.

source: Current Prototype
de_de: Aktueller Prototyp

source: Last updated on October 2, 2024
de_de: Letztes Update: Oktober 2, 2024

source: Explore
de_de: Entdecken

source: Explore user-created tours that are popular, close to you, or find your next destination with the highest rated tours around the world.
de_de: Erkunden Sie von Nutzern erstellte Touren, die beliebt sind und sich in Ihrer Nähe befinden, oder finden Sie Ihr nächstes Ziel mit den am besten bewerteten Touren auf der ganzen Welt.

source: Get point-to-point navigation powered by Google API, and detailed descriptions for the places you'll see. Take in your destination while you listen to the history and fun facts with text-to-speech.
de_de: Erhalten Sie eine Punkt-zu-Punkt-Navigation, die von der Google API unterstützt wird, und detaillierte Beschreibungen der Orte, die Sie sehen werden. Sehen Sie sich Ihr Ziel an, während Sie sich mit Text-to-Speech die Geschichte und interessante Fakten anhören.

source: AI Tourguide
de_de: KI Tourguide

source: Ask your AI Tourguide about the best local destinations, parks, or beaches, or get a brief overview of the history or meaning of a place. Powered by Google Gemini with Vertex AI.
de_de: Fragen Sie Ihren KI-Tourguide nach den besten lokalen Reisezielen, Parks oder Stränden oder erhalten Sie einen kurzen Überblick über die Geschichte oder Bedeutung eines Ortes. Unterstützt von Google Gemini mit Vertex AI.

source: Contribute
de_de: Beitragen

source: Easily create new tours to contribute to the community, using a form powered by flutter's stepper widget. Add basic info, places, details, and you're done and the new tour is ready for people to explore.
de_de: Erstellen Sie ganz einfach neue Touren, die Sie der Community zur Verfügung stellen möchten, indem Sie ein Formular mit dem Stepper-Widget von Flutter verwenden. Fügen Sie grundlegende Informationen, Orte und Details hinzu, und schon ist die neue Tour fertig und kann erkundet werden.

source: Profile
de_de: Profil

source: Manage your profile settings, notification settings, and manage your account.
de_de: Verwalten Sie Ihre Profileinstellungen, Benachrichtigungseinstellungen und Ihr Konto.

source: Web Improvements, tts, and more - October 2, 2024
de_de: Web-Verbesserungen, tts, und mehr - 2. Oktober 2024

source: Over the last month I spent a lot of time polishing the UX of existing features and ensuring full support for all functionality on the web. When I released the first stable web build, there were a couple of issues left to address. Some of these turned out to be rather difficult to solve, for instance, I had to set up Firebase Cloud functions to fetch directions due to restrictions with the Google API I'm using. I also added more media queries to better adapt UI to a wide range of screen sizes.
de_de: Im letzten Monat habe ich viel Zeit damit verbracht, die Benutzerfreundlichkeit der bestehenden Funktionen zu verbessern und die volle Unterstützung aller Funktionen im Web sicherzustellen. Als ich den ersten stabilen Web-Build veröffentlicht habe, gab es noch ein paar Probleme zu lösen. Einige davon erwiesen sich als ziemlich schwierig zu lösen, z. B. musste ich Firebase Cloud-Funktionen zum Abrufen von Wegbeschreibungen einrichten, da die von mir verwendete Google-API Einschränkungen aufweist. Außerdem habe ich weitere Media-Queries hinzugefügt, um die Benutzeroberfläche besser an eine Vielzahl von Bildschirmgrößen anzupassen.

source: A new feature that I added, to improve the UX of interacting with the text-to-speech (tts) feature on tours, is interactive text-to-speech, where users can tap any word to start reading from there, and tts settings for things like speech rate and voice selection. This also made for quite a challenge with the web implementation, because the tts package I was using, didn't have the progress update events for web, that I needed.
de_de: Eine neue Funktion, die ich hinzugefügt habe, um die Benutzerfreundlichkeit bei der Interaktion mit der Text-to-Speech-Funktion (tts) auf Touren zu verbessern, ist die interaktive Text-to-Speech-Funktion, bei der die Benutzer auf ein beliebiges Wort tippen können, um von dort aus mit dem Lesen zu beginnen, sowie tts-Einstellungen für Dinge wie Sprachgeschwindigkeit und Sprachauswahl. Dies machte auch die Web-Implementierung zu einer ziemlichen Herausforderung, da das tts-Paket, das ich verwendete, nicht über die Fortschrittsaktualisierungsereignisse für das Web verfügte, die ich benötigte.

source: To fix the lack of web support for progress updates with flutter_tts, I added the missing event myself, and opened a PR. I'm hoping my change will be added and make this feature more widely available. Being inspired by working on this package, I decided to also have a try at creating my own package. I created and published the
de_de: Um die fehlende Webunterstützung für Fortschrittsaktualisierungen mit flutter_tts zu beheben, habe ich das fehlende Ereignis selbst hinzugefügt und einen PR eröffnet. Ich hoffe, dass meine Änderung hinzugefügt wird und diese Funktion weiter verbreitet wird. Inspiriert durch die Arbeit an diesem Paket beschloss ich, mich auch an der Erstellung meines eigenen Pakets zu versuchen. Ich erstellte und veröffentlichte das

source: package, based off utility code I had written. This package helps dynamically create markers with various customizable shapes, with the option for labels.
de_de: Paket, das auf dem von mir geschriebenen Utility-Code basiert. Dieses Paket hilft dynamisch erstellen Markierungen mit verschiedenen anpassbaren Formen, mit der Option für Etiketten.

source: Update and release of Web App - August 27, 2024
de_de: Aktualisierung und Veröffentlichung der Web-App - 27. August 2024

source: I'm thrilled to announce Tourguide's launch as a web app! You can find it at
de_de: Ich freue mich sehr, den Start von Tourguide als Web-App bekannt zu geben! Sie finden sie unter

source: . Adding web support marked a key milestone. Initial functionality worked well thanks to Flutter's cross-platform support, but there were some challenges with image handling, CORS issues, and UI adaptation for widescreens. Future efforts will focus on enhancing web UX and ensuring full support for all features on the web.
de_de: . Das Hinzufügen der Webunterstützung war ein wichtiger Meilenstein. Die anfängliche Funktionalität funktionierte dank der plattformübergreifenden Unterstützung von Flutter gut, aber es gab einige Herausforderungen bei der Handhabung von Bildern, CORS-Problemen und der Anpassung der Benutzeroberfläche für Breitbildschirme. Zukünftige Bemühungen werden sich auf die Verbesserung der Web-UX und die Sicherstellung der vollen Unterstützung für alle Funktionen im Web konzentrieren.

source: Update - August 19, 2024
de_de: Update - 19. August 2024

source: Since moving to open testing, I've been focused on MVP UX polish and style improvements. An area of focus has been Tour Running UX/UI, which I enhanced to make it more immersive, and provide the user with richer map interactions as the tour progresses.
de_de: Seit dem Wechsel zum offenen Testen habe ich mich auf die Optimierung der MVP UX und stilistische Verbesserungen konzentriert. Ein Schwerpunkt war die UX/UI der Tour, die ich verbessert habe, um sie immersiver zu machen und dem Benutzer reichhaltigere Karteninteraktionen zu bieten, während die Tour fortschreitet.

source: Regarding style improvements, I reworked all hardcoded style references to use the current theme and created a theme provider and cleaned up theme building logic. With these changes, the UI now adheres more stringently to Material 3 Design styles, and supports dark mode. To help with that process, I first used the
de_de: Hinsichtlich der Stilverbesserungen habe ich alle fest kodierten Stilreferenzen überarbeitet, um das aktuelle Thema zu verwenden, und einen Themenanbieter erstellt und die Logik für die Themenerstellung bereinigt. Mit diesen Änderungen hält sich die Benutzeroberfläche nun strikter an die Material 3-Designstile und unterstützt den dunklen Modus. Um diesen Prozess zu unterstützen, habe ich zunächst die

source: , and then built an
de_de: und baute dann ein

source: interactive mockup in Figma
de_de: interaktives Mockup in Figma

source: , using the very helpful Figma Material 3 Design Kit template and Material Theme Builder plugin.
de_de: mit der sehr hilfreichen Vorlage Figma Material 3 Design Kit und dem Plugin Material Theme Builder.

source: I'm happy with these changes and what I've learned about the Material Design system in the process. My goal now is to work on enhancing functionality and return to more UI polish down the line.
de_de: Ich bin zufrieden mit diesen Änderungen und dem, was ich dabei über das Material Design System gelernt habe. Mein Ziel ist es nun, an der Verbesserung der Funktionalität zu arbeiten und die Benutzeroberfläche weiter zu verfeinern.

source: Update - July 29, 2024
de_de: Update - 29. Juli 2024

source: I've made good progress and have published the app to Open Testing (Beta) on Google Play. In order to get CI/CD with fastlane and GitHub Actions up and running, I had to first publish my app. This required quite a bit of work in order to make sure that I comply with all the requirements - things like the ability to block and report users or content, ensuring account and data deletion works, and adding TOS and a privacy policy.
de_de: Ich bin gut vorangekommen und habe die App zum offenen Testen (Beta) auf Google Play veröffentlicht. Um CI/CD mit Fastlane und GitHub Actions zum Laufen zu bringen, musste ich meine App zunächst veröffentlichen. Das erforderte einiges an Arbeit, um sicherzustellen, dass ich alle Anforderungen erfülle - Dinge wie die Möglichkeit, Nutzer oder Inhalte zu sperren und zu melden, sicherzustellen, dass das Löschen von Konten und Daten funktioniert, und AGB und eine Datenschutzerklärung hinzuzufügen.

source: The last few weeks have been a great learning experience, as I got to really dig into the backend side of things, setting up email notifications and a system for myself to manage community reports. I discovered the great library of Firebase extensions like Trigger Email from Firestore and Delete User Data, which have come in handy. To extend their functionality, I also wrote some cloud functions to help with processes like unsubscribing from emails through a link in the email.
de_de: Die letzten Wochen waren eine großartige Lernerfahrung, da ich mich wirklich in die Backend-Seite der Dinge vertieft habe, indem ich E-Mail-Benachrichtigungen und ein System für mich selbst zur Verwaltung von Community-Berichten eingerichtet habe. Ich entdeckte die großartige Bibliothek von Firebase-Erweiterungen wie Trigger Email from Firestore und Delete User Data, die sich als sehr nützlich erwiesen. Um ihre Funktionalität zu erweitern, habe ich auch einige Cloud-Funktionen geschrieben, die bei Prozessen wie dem Abbestellen von E-Mails über einen Link in der E-Mail helfen.

source: Wrapping up this work I moved on to setting up CI/CD. I had previous experience with managing CI/CD such as Azure Pipelines and XCode Cloud, but this was my first time setting it all up by myself, and also my first time using fastlane or GitHub Actions. For debugging purposes I also learned some of the basics of Docker and VirtualBox to standardize and test different environments. It's now up and running, with commits to my main branch automatically building and deploying to Google Play, which is pretty sweet.
de_de: Zum Abschluss dieser Arbeit ging ich dazu über, CI/CD einzurichten. Ich hatte bereits Erfahrung mit der Verwaltung von CI/CD wie Azure Pipelines und XCode Cloud, aber dies war das erste Mal, dass ich alles selbst einrichtete, und auch das erste Mal, dass ich Fastlane oder GitHub Actions verwendete. Zu Debugging-Zwecken habe ich auch einige der Grundlagen von Docker und VirtualBox gelernt, um verschiedene Umgebungen zu standardisieren und zu testen. Es ist jetzt einsatzbereit und läuft, wobei Commits an meinen Hauptzweig automatisch erstellt und bei Google Play bereitgestellt werden, was ziemlich toll ist.

source: Getting Started - July 10, 2024
de_de: Erste Schritte - 10. Juli 2024

source: The tourguide app is currently in closed testing on the Google Play store. I plan to also host it as a webapp, and possibly an iOS app if I see demand for the app. You can
de_de: Die Tourguide-App befindet sich derzeit in der geschlossenen Testphase im Google Play Store. Ich plane, sie auch als Webapp zu hosten, und möglicherweise eine iOS-App, wenn ich die Nachfrage nach der App sehe. Sie können

source: request
de_de: anfragen

source: to join testing if you're interested in trying it out.
de_de: um an den Tests teilzunehmen, wenn Sie daran interessiert sind, es auszuprobieren.

source: As of July 2024 the app has functionality for users to create a tour with waypoints, an explore page to browse these user-created tours, an AI chat page utilizing Google's Gemini AI roleplaying as a helpful tourguide, and a profile page. I'm using Firebase services such as Authentication, Firestore, Storage, Crashlytics and Remote Config, as well as Google APIs like Places, Maps and Vertex AI to power my app.
de_de: Ab Juli 2024 bietet die App Nutzern die Möglichkeit, eine Tour mit Wegpunkten zu erstellen, eine Erkundungsseite zum Durchsuchen dieser von Nutzern erstellten Touren, eine KI-Chat-Seite, die Googles Gemini-KI-Rollenspiel als hilfreichen Reiseführer nutzt, und eine Profilseite. Ich verwende Firebase-Dienste wie Authentifizierung, Firestore, Storage, Crashlytics und Remote Config sowie Google APIs wie Places, Maps und Vertex AI, um meine App zu betreiben.

source: Screenshots from 2024/08/04
de_de: Screenshots vom 2024/08/04

source: What I've learned so far
de_de: Was ich bis jetzt gelernt habe

source: Flutter has been a delight to work with. I was previously working at
de_de: Es war eine Freude, mit Flutter zusammenzuarbeiten. Ich arbeitete zuvor bei

source: , where I was creating complex UIs with C# in Unity, a setup that's not really ideal for creating complex UIs, even less so with Clirio's apps supporting VR, MR, touchscreens on iOS and Android, as well as Desktop, and catering UI for each of those platforms. In comparison to the challenges this posed, Flutter makes it a breeze to implement complex UIs across many devices, while also working with an intuitive architecture of Stateless- and StatefulWidgets, Providers, and a large amount of packages to help speed up common tasks.
de_de: Dort habe ich komplexe UIs mit C# in Unity erstellt, ein Setup, das nicht wirklich ideal für die Erstellung komplexer UIs ist, schon gar nicht mit Clirios Apps, die VR, MR, Touchscreens auf iOS und Android sowie Desktop und Catering UI für jede dieser Plattformen unterstützen. Im Vergleich zu den damit verbundenen Herausforderungen ist es mit Flutter ein Kinderspiel, komplexe UIs über viele Geräte hinweg zu implementieren und gleichzeitig mit einer intuitiven Architektur aus Stateless- und StatefulWidgets, Providern und einer großen Anzahl von Paketen zu arbeiten, die dabei helfen, gängige Aufgaben zu beschleunigen.

source: You can see what I still have planned on my scrum board. It's a lot :)
de_de: Auf meinem Scrum Board könnt ihr sehen, was ich noch geplant habe. Es ist eine Menge :)
