Repository: Robert01101101/Portfolio-RMichels
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de_de

source: About Me
de_de: Über Mich

source: Hi there, I'm Robert!
de_de: Hallo, Ich bin Robert!

source: I'm a software developer and designer from Vancouver. My inexhaustible curiosity and love for digital media led me to attend Simon Fraser University (SFU), where I earned my Bachelor's Degree of Science with a major in Interactive Arts & Technology.
de_de: Ich bin ein Software Designer und Entwickler aus Vancouver. Meine unerschöpfliche Neugier und Liebe für digitale Medien führten mich dazu, die Simon Fraser University (SFU) zu besuchen, wo ich meinen Bachelor of Science mit einem Schwerpunkt in Interaktiver Kunst und Technologie erworben habe.

source: I've prototyped, designed, and developed various interactive applications throughout my career, covering everything from XR to web development. These experiences have shaped me into a designer who emphasizes a user-goal-driven approach, a developer who values scalability and accessibility, and an expert in rapid prototyping.
de_de: Im Laufe meiner Karriere habe ich verschiedene interaktive Anwendungen prototypisiert, entworfen und entwickelt, die alles von XR bis zur Webentwicklung abdecken. Diese Erfahrungen haben mich zu einem Designer geformt, der eine benutzerzielorientierte Herangehensweise betont, zu einem Entwickler, der Skalierbarkeit und Zugänglichkeit schätzt, und zu einem Experten im Bereich des schnellen Prototypings.

source: Contact me if you would like to make cool stuff together! I'm currently looking for work.
de_de: Kontaktieren Sie mich, wenn Sie gemeinsam an coolen Projekten arbeiten möchten! Derzeit bin ich auf der Suche nach Arbeit.

source: Say Hi:
de_de: Sag Hi:

source: Skills
de_de: Fähigkeiten

source: Programming
de_de: Programmieren

source: Development
de_de: Entwicklung

source: Other
de_de: Sonstige

source: Featured Work
de_de: Projektübersicht

source: About
de_de: Über Mich

source: All Projects
de_de: Alle Projekte

source: This portfolio website was
de_de: Diese Portfolio Website wurde mit dem LAMP-Stack

source: developed
de_de: entwickelt

source: Copyright
de_de: Urheberrecht

source: Robert Michels. All Rights Reserved.
de_de: Robert Michels. Alle Rechte vorbehalten.

source: Enable Smooth Scrolling
de_de: Sanftes Scrollen

source: Resume
de_de: Lebenslauf

source: Privacy Policy
de_de: Datenschutzerklärung

source: Copied to Clipboard!
de_de: In die Zwischenablage kopiert!

source: , <br>I'm Robert Michels.
de_de: , <br>Ich bin Robert Michels.

source: Hi, I'm Robert&nbsp;Michels.
de_de: Hi, Ich bin Robert&nbsp;Michels.

source: I design and program
de_de: Ich designe und programmiere

source: full-stack apps.", "games.", "VR experiences.", "mobile apps.", "websites.
de_de: Full-Stack Apps.", "Videospiele.", "VR Erlebnisse.", "Mobile Apps.", "Websiten.

source: digital media.
de_de: Digitale Medien.

source: See More
de_de: Siehe Mehr

source: A web-based collection of tools for managing workspaces in Clirio View. Includes a user dashboard, workspace and observation creation tools, and interactive Bing maps.
de_de: Eine webbasierte Sammlung von Tools zur Verwaltung von Arbeitsbereichen in Clirio View. Enthält ein Benutzer-Dashboard, Tools zur Erstellung von Arbeitsbereichen und Beobachtungen sowie interaktive Bing-Karten.

source: Overview
de_de: Übersicht

source: Clirio Cloud is a collection of tools that have been growing over time. These tools are provided to users of the Clirio Suite on a website developed with Blazor. Clirio builds solutions that help users inspect, document, and collaborate in 3D and XR on geospatial workspaces.
de_de: Clirio Cloud ist eine Sammlung von Tools, die im Laufe der Zeit gewachsen ist. Diese Tools werden den Nutzern der Clirio Suite auf einer mit Blazor entwickelten Website zur Verfügung gestellt. Clirio entwickelt Lösungen, die den Nutzern helfen, geodätische Arbeitsbereiche in 3D und XR zu inspizieren, zu dokumentieren und zusammenzuarbeiten.

source: One of the main goals of Clirio Cloud is to complement the upload and organizational capabilities of the iOS Clirio apps, which serve as the primary capture platform. While a user can easily capture and upload 3D photogrammetry scans with Clirio's iOS apps, they might also want to upload other 3D models, for which Clirio Cloud provides an interface. Other workspace tools are upload and management of custom basemaps, upload of boreholes, guest invitations, point of interest creation, and workspace deletion.
de_de: Eines der Hauptziele von Clirio Cloud ist es, die Upload- und Organisationsfunktionen der iOS-Apps von Clirio zu ergänzen, die als primäre Erfassungsplattform dienen. Während ein Benutzer mit den iOS-Apps von Clirio problemlos 3D-Photogrammetriescans erfassen und hochladen kann, möchte er möglicherweise auch andere 3D-Modelle hochladen, für die Clirio Cloud eine Schnittstelle bereitstellt. Weitere Werkzeuge für den Arbeitsbereich sind das Hochladen und Verwalten von benutzerdefinierten Basiskarten, das Hochladen von Bohrlöchern, das Einladen von Gästen, das Erstellen von Points of Interest und das Löschen von Arbeitsbereichen.

source: Furthermore, Clirio Cloud provides an analytics dashboard to users, as well as an easy way to access the Clirio knowledge base and training videos. Finally, there also are subscription and account management tools.
de_de: Darüber hinaus bietet Clirio Cloud den Nutzern ein Analyse-Dashboard sowie eine einfache Möglichkeit, auf die Clirio-Wissensdatenbank und Schulungsvideos zuzugreifen. Schließlich gibt es auch Tools zur Abonnement- und Kontoverwaltung.

source: Workspace List
de_de: Workspace Liste

source: Workspace Management Example: Create POI
de_de: Workspace Management Beispiel: Erstelle POI

source: The website was initially set up by
de_de: Die Website wurde ursprünglich eingerichtet von

source: using Blazor, to try using a web framework that has C# as its programming language, which would be an advantage considering we also used C# for Unity development. After setting up authentication, subscription management, and workspace listing with metadata, development was mostly handed off to me.
de_de: unter der verwendung von Blazor, um ein Web-Framework mit C# als Programmiersprache auszuprobieren, was ein Vorteil wäre, wenn man bedenkt, dass wir C# auch für die Unity-Entwicklung verwenden. Nach der Einrichtung der Authentifizierung, der Abonnementverwaltung und der Auflistung der Arbeitsbereiche mit Metadaten wurde die Entwicklung größtenteils an mich übergeben.

source: The first stories I implemented revolved around workspace management, where I added observation upload features. These typically use Blazor's forms to let users fill out required information, and a file upload tray. These first stories encompassed a variety of challenges. I had to connect to our APIs to load workspace and POI data, as well as to upload data. There was also the need to validate certain data such as coordinates, and to provide user feedback such as marking required or incorrect fields and showing the upload status. I designed the UI on the fly, following the existing styling.
de_de: Die ersten features, die ich implementiert habe, drehten sich um die Verwaltung von Arbeitsbereichen, wo ich Funktionen zum Hochladen von Beobachtungen hinzugefügt habe. Diese nutzen typischerweise die Formulare von Blazor, um den Benutzern das Ausfüllen der erforderlichen Informationen zu ermöglichen, sowie einen Dateiupload-Tray. Diese ersten Projekte waren mit einer Reihe von Herausforderungen verbunden. Ich musste eine Verbindung zu unseren APIs herstellen, um Arbeitsraum- und POI-Daten zu laden und Daten hochzuladen. Außerdem mussten bestimmte Daten, wie z. B. Koordinaten, validiert und dem Benutzer Feedback gegeben werden, z. B. durch Markierung erforderlicher oder falscher Felder und Anzeige des Upload-Status. Ich habe die Benutzeroberfläche währrend der Umsetzung entworfen und mich dabei an das bestehende Styling gehalten.

source: After adding all of the workspace management features such as 3D model upload and user invitations, I started working on another set of stories revolving around the dashboard. I partnered up with
de_de: Nachdem ich alle Funktionen zur Verwaltung des Arbeitsbereichs, wie z. B. den Upload von 3D-Modellen und Benutzereinladungen, hinzugefügt hatte, begann ich mit der Arbeit an einer weiteren Reihe von Geschichten, die sich um das Dashboard drehten. Ich habe mich gepartnert mit

source: , who designed mockups, which I then implemented.
de_de: , der Mockups entwarf, die ich dann umsetzte.

source: A noteworthy feature that was added fairly late, are the interactive Bing maps. These are used to position new workspaces and points of interest and can get the user's location for convenience. They are accommodated by a set of GPS coordinate input fields, which sync with the map.
de_de: Eine bemerkenswerte Funktion, die relativ spät hinzugefügt wurde, sind die interaktiven Bing-Karten. Diese werden verwendet, um neue Arbeitsbereiche und Points of Interest zu positionieren, und können den Standort des Benutzers zur Bequemlichkeit abrufen. Sie werden durch eine Reihe von Eingabefeldern für GPS-Koordinaten unterstützt, die mit der Karte synchronisiert werden.

source: Learning
de_de: Lehren

source: I enjoyed learning Blazor, as it shared some similarities to PHP but had quite a lot of advantages, such as easy form binding to data models, data validation, and improved readability and writeability to me as a developer who often works in C#. Besides Blazor, the Tailwind CSS Framework was also new to me, but learning that wasn't too hard since I am fairly familiar with CSS3. I did enjoy learning about it too, because I prefer its customizability and efficiency compared to Bootstrap, although I still prefer Sass for my personal projects.
de_de: Es hat mir Spaß gemacht, Blazor zu lernen, da es einige Ähnlichkeiten mit PHP aufweist, aber eine ganze Reihe von Vorteilen hat, wie z. B. die einfache Formularanbindung an Datenmodelle, die Datenvalidierung und die verbesserte Lesbarkeit und Schreibbarkeit für mich als Entwickler, der oft in C# arbeitet. Neben Blazor war auch das Tailwind CSS Framework neu für mich, aber das zu lernen war nicht allzu schwer, da ich mit CSS3 recht gut vertraut bin. Es hat mir auch Spaß gemacht, es kennenzulernen, weil ich seine Anpassbarkeit und Effizienz im Vergleich zu Bootstrap bevorzuge, obwohl ich für meine persönlichen Projekte immer noch Sass bevorzuge.

source: Some examples of data model binding to forms in Blazor. Expanding/collapsing optional sections of the form, and rearranging elements in a list, is made easy with Blazor since user inputs result in direct feedback without the need to write boilerplate code.
de_de: Einige Beispiele für die Anbindung von Datenmodellen an Formulare in Blazor. Das Erweitern/Kollabieren von optionalen Abschnitten des Formulars und das Umordnen von Elementen in einer Liste wird mit Blazor leicht gemacht, da die Benutzereingaben zu einem direkten Feedback führen, ohne dass man Boilerplate-Code schreiben muss.

source: Code Sample
de_de: Code Beispiel

source: An example of data binding between the form and data model for the
de_de: Ein Beispiel für die Datenbindung zwischen dem Formular und dem Datenmodell für die

source: Create POI
de_de: POI Erstellen

source: page.
de_de: Seite.

source: Type
de_de: Kategorie

source: Year
de_de: Jahr

source: Skills Applied
de_de: Angewandte Fähigkeiten

source: Company
de_de: Firma

source: A collection of features in the Clirio View apps for loading and viewing photogrammetry scans. Includes on-map, XR, comparison, and other views.
de_de: Eine Sammlung von Funktionen in den Clirio View Anwendungen zum Laden und Betrachten von Photogrammetrie-Scans. Umfasst die Ansichten Auf der Karte, XR, Vergleich und andere Ansichten.

source: One of the key features of the Clirio product suite is the capability to capture photogrammetry scans with LiDAR-enabled iOS devices, and then manage and view those scans. Captured scans can be viewed on-map, they can be always-on as an integral part of the map, or they can be viewed in scan view mode which comes with measure, comparison, and XR capabilities depending on the platform. In XR view, the scan can be scaled to
de_de: Eine der wichtigsten Funktionen der Clirio-Produktsuite ist die Möglichkeit, photogrammetrische Scans mit LiDAR-fähigen iOS-Geräten zu erfassen und diese Scans anschließend zu verwalten und anzuzeigen. Erfasste Scans können auf der Karte angezeigt werden, sie können immer als integraler Bestandteil der Karte angezeigt werden, oder sie können im Scan-Ansichtsmodus angezeigt werden, der je nach Plattform über Mess-, Vergleichs- und XR-Funktionen verfügt. In der XR-Ansicht kann der Scan skaliert werden auf

source: or 1:1 scale, or freely manipulated with hand manipulation. On iOS and Desktop, the view is controlled by touch or mouse inputs. Comparison views feature side-by-side, swipe, and overlay modes. Besides scans captured with Clirio Scan, other 3D models are also supported and can be uploaded on
de_de: oder im Maßstab 1:1, oder frei mit der Hand manipuliert werden. Auf iOS und Desktop wird die Ansicht durch Touch- oder Mauseingaben gesteuert. Vergleichsansichten bieten die Modi Seite-an-Seite, Streichen und Überlagern. Neben Scans, die mit Clirio Scan erfasst wurden, werden auch andere 3D-Modelle unterstützt und können hochgeladen werden in die

source: On-Map View (Desktop)
de_de: Auf der Karte Ansicht (Desktop)

source: Scan View Comparison Mode (Desktop)
de_de: Scan View Vergleichsmodus (Desktop)

source: The scan views have been continuously worked on from 2021 to 2023. In that timeframe, I was responsible for setting up most of the logic and views involved. My workflow involved designing UX and UI, and then quickly prototyping and refining until each feature was ready for release. My teammates
de_de: An den Scanansichten wurde von 2021 bis 2023 kontinuierlich gearbeitet. In diesem Zeitraum war ich für die Einrichtung der meisten Logiken und Ansichten verantwortlich. Zu meinem Arbeitsablauf gehörte das Entwerfen von UX und UI und dann das schnelle Prototyping und die Verfeinerung, bis jede Funktion für die Veröffentlichung bereit war. Meine Teamkollegen

source: , and
de_de: und

source: also made contributions. Some functionality was also carried over from the Ada Viewer app, upon which the Clirio View app was based.
de_de: leisteten ebenfalls Beiträge. Einige Funktionen wurden auch von der Ada-Viewer-App übernommen, auf der die Clirio-View-App basiert.

source: The initial set of requirements was the loading and viewing of scans in a scan view mode (no map), which would be supported in AR on the HoloLens 2, and in 3D non-AR on iOS. Once these core functionalities had been implemented, one of the most important additions was the comparison and measure modes. An important workflow supported by the Clirio View apps is the analysis and monitoring of construction sites, for which scan comparisons help detect differences, and scan measurements help understand scale.
de_de: Die ersten Anforderungen waren das Laden und Betrachten von Scans in einem Scan-Ansichtsmodus (keine Karte), der in AR auf der HoloLens 2 und in 3D-Non-AR auf iOS unterstützt werden sollte. Nachdem diese Kernfunktionalitäten implementiert worden waren, war eine der wichtigsten Ergänzungen der Vergleichs- und Messmodus. Ein wichtiger Arbeitsablauf, der von den Clirio View-Apps unterstützt wird, ist die Analyse und Überwachung von Baustellen, bei denen Scan-Vergleiche helfen, Unterschiede zu erkennen, und Scan-Messungen helfen, den Maßstab zu verstehen.

source: Later, other features were added, such as viewing scans on-map, more viewing tools such as freehand manipulation in XR, and more comparison modes such as the overlay mode which fades the transparencies on XR, and the swipe comparison view on iOS which crops the viewports.
de_de: Später kamen weitere Funktionen hinzu, z. B. die Anzeige von Scans auf der Karte, weitere Anzeigewerkzeuge wie die Freihandmanipulation in XR und weitere Vergleichsmodi wie der Überlagerungsmodus, mit dem die Transparenzen in XR ausgeblendet werden, und die Swipe-Vergleichsansicht in iOS, die die Ansichtsfenster beschneidet.

source: An overview of the different scan views in the Clirio View Meta Quest VR app. A scan is first opened on-map, then scan view is entered, where the scan is viewed from different angles, measured, and compared to another scan.
de_de: Ein Überblick über die verschiedenen Scanansichten in der Clirio View Meta Quest VR-App. Ein Scan wird zunächst auf der Karte geöffnet, dann wird die Scanansicht aufgerufen, in der der Scan aus verschiedenen Blickwinkeln betrachtet, gemessen und mit einem anderen Scan verglichen wird.

source: Challenges
de_de: Herausforderungen

source: One of the biggest challenges has been the complexity originating from different UX flows, platforms, features, and states which have been expanded slowly over time. Particularly in the final
de_de: Eine der größten Herausforderungen war die Komplexität, die sich aus den verschiedenen UX-Flows, Plattformen, Funktionen und Zuständen ergab, die im Laufe der Zeit langsam erweitert wurden. Besonders in den letzten

source: versions of the Clirio View apps, complexity had ballooned, as MRTK2 had poor cross-platform support, which resulted in different prefabs, UI, and logic for iOS and HMDs.
de_de: Versionen der Clirio View-Apps hatte die Komplexität stark zugenommen, da MRTK2 nur unzureichend plattformübergreifende Unterstützung bot, was zu unterschiedlichen Prefabs, UI und Logik für iOS und HMDs führte.

source: Another layer of complexity was the different file formats, features, and sources for 3D models. Especially the various material properties, texture reference formats, coordinate and unit systems were tricky to develop and test for.
de_de: Eine weitere Ebene der Komplexität waren die verschiedenen Dateiformate, Funktionen und Quellen für 3D-Modelle. Insbesondere die verschiedenen Materialeigenschaften, Texturreferenzformate, Koordinaten- und Einheitensysteme waren schwierig zu entwickeln und zu testen.

source: Solutions for these complexity challenges typically involved unifying behaviors, once similarities had been identified, and there was time to refactor. For instance, saving the initial state and reset behavior was unified across platforms and modes, and the logic for switching in and out of AR in scan view was combined with the logic for doing the same in map view. Furthermore, with the migration to
de_de: Die Lösungen für diese Komplexitätsherausforderungen bestanden in der Regel in der Vereinheitlichung von Verhaltensweisen, sobald Ähnlichkeiten identifiziert worden waren und Zeit für ein Refactoring zur Verfügung stand. So wurden beispielsweise das Speichern des Ausgangszustands und das Rücksetzverhalten plattform- und modusübergreifend vereinheitlicht, und die Logik für das Ein- und Ausschalten von AR in der Scanansicht wurde mit der Logik für dasselbe in der Kartenansicht kombiniert. Außerdem wurde mit der Migration zu

source: , view logic and prefabs were combined, which greatly reduced complexity.
de_de: Ansichtslogik und Prefabs kombiniert, was die Komplexität erheblich reduzierte.

source: Scan Share is a feature of the Clirio product suite, for sharing photogrammetry scans quickly, and displaying them in a webviewer.
de_de: Scan Share ist eine Funktion der Clirio-Produktsuite, mit der Photogrammetriescans schnell ausgetauscht und in einem Webviewer angezeigt werden können.

source: The Clirio Scan Share feature lets users quickly share a photogrammetry scan captured with the Clirio Scan app. The feature is comprised of share options in the Clirio View app developed in Unity and a webviewer developed in Blazor and Three.js, through which shared scans can be viewed. Pressing the share button on any of the Clirio View apps will open a pop-up to configure the share. The user has the option to set expiry, password protection, and to require that the viewer has been invited to the workspace, in which case the recipient will need to log in with their Clirio account to view the scan.
de_de: Mit der Clirio Scan Share-Funktion können Benutzer einen mit der Clirio Scan-App erfassten Photogrammetrie-Scan schnell teilen. Die Funktion besteht aus Freigabeoptionen in der in Unity entwickelten Clirio View-App und einem in Blazor und Three.js entwickelten Webviewer, über den geteilte Scans betrachtet werden können. Durch Drücken der Freigabe-Schaltfläche in einer der Clirio View-Apps öffnet sich ein Pop-up-Fenster zur Konfiguration der Freigabe. Der Benutzer hat die Möglichkeit, den Ablauf und den Passwortschutz festzulegen und zu verlangen, dass der Betrachter in den Arbeitsbereich eingeladen wurde. In diesem Fall muss sich der Empfänger mit seinem Clirio-Konto anmelden, um den Scan anzuzeigen.

source: Once the user is satisfied with their selected options, they can generate the link, and either copy it to the clipboard or use the share function to trigger the share options native to each platform. For instance, on iOS this will open the share dialogue with compatible apps such as messengers, while on Windows the mail app will open. There is also an option for users to configure and generate a formatted embed iframe element with the share.
de_de: Sobald der Benutzer mit den ausgewählten Optionen zufrieden ist, kann er den Link erstellen und ihn entweder in die Zwischenablage kopieren oder die Freigabefunktion verwenden, um die plattformeigenen Freigabeoptionen auszulösen. Unter iOS wird beispielsweise der Freigabedialog mit kompatiblen Apps wie Messenger geöffnet, während unter Windows die Mail-App geöffnet wird. Es gibt auch eine Option, mit der die Nutzer ein formatiertes, eingebettetes Iframe-Element für die Freigabe konfigurieren und generieren können.

source: The webviewer through which recipients can view the scan is intended to be as lightweight and accessible as possible. The scan can be viewed from different angles, some metadata and a scale legend is displayed, and there are some buttons to hide or show elements.
de_de: Der Webviewer, mit dem die Empfänger den Scan betrachten können, soll so einfach und zugänglich wie möglich sein. Der Scan kann aus verschiedenen Blickwinkeln betrachtet werden, es werden einige Metadaten und eine Maßstabslegende angezeigt, und es gibt einige Schaltflächen zum Ein- und Ausblenden von Elementen.

source: An interactive example of an embedded scan share. Click and drag to look at the model from different angles. The same share can also be opened on its
de_de: Ein interaktives Beispiel für eine eingebettete Scanshare. Klicken und ziehen Sie, um das Modell aus verschiedenen Blickwinkeln zu betrachten. Der scan ist auch erreichbar auf seiner eigenen

source: page
de_de: Seite

source: There were two stories for the development of this feature: the clientside app share UI and logic, and the webviewer.
de_de: Für die Entwicklung dieser Funktion gab es zwei Bereiche: die gemeinsame Nutzung der Benutzeroberfläche und der Logik der clientseitigen Anwendung und den Webviewer.

source: Share UI and Logic
de_de: Sharing UI und Logik

source: Developed with C# in Unity, as a pop-up accessible through the observation details view of any scan in the Clirio View app. UI was designed in Figma in collaboration with
de_de: Entwickelt mit C# in Unity, als Pop-up, das über die Beobachtungsdetails eines beliebigen Scans in der Clirio View App zugänglich ist. Die Benutzeroberfläche wurde in Figma in Zusammenarbeit mit Jordan Wischmann entworfen.

source: Developed with Blazor and Three.js. Backend token sharing was implemented by
de_de: Entwickelt mit Blazor und Three.js. Backend Token-Sharing wurde implementiert von
